Процедура ЧтениеИЗаписьНабораДанных(Знач Валюта, Знач Дата, Знач Курс)
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	Попытка
		Блокировка_ = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка_.Добавить("РегистрСведений.КурсыВалют");
		ЭлементБлокировки.УстановитьЗначение("Валюта",Валюта);
		ЭлементБлокировки.УстановитьЗначение("Период",Дата);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка_.Заблокировать();
		НЗ = РегистрыСведений.КурсыВалют.СоздатьНаборЗаписей();
		НЗ.Отбор.Валюта.Установить(Валюта); 
		НЗ.Отбор.Период.Установить(Дата); 
		НЗ.Прочитать();
	    Для каждого Запись_ Из НЗ Цикл
		 	Запись_.Курс = Курс;
		КонецЦикла;
		НЗ.Записать();
	    ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
	КонецПопытки;
КонецПроцедуры
